{
    "internationalizations": [
        {
            "description": "I was introduced to computers at a young age when my dad gifted me one for achieving first rank in my class. As I played games and became more curious, my interest in computers grew. In 10th grade, I had to choose a career path, and it was an easy decision for me to pursue a diploma in Computer Engineering.<br>During my diploma, I explored both hardware and software subjects and discovered a strong inclination towards the software world. While focusing on software, I also maintained a connection to hardware through personal projects.<br>After completing my diploma, I pursued a degree in Information Technology to expand my software knowledge. I started envisioning myself as a software developer solving real-world problems. I participated in coding competitions and became passionate about coding.<br>When I reached my final year of the bachelor's degree, I faced a choice between higher studies and getting a job. This time, I decided to gain some practical experience and learn while making money.<br>After a few years in the industry, I felt the urge to further expand my knowledge, so I pursued a Masters in Applied Computing. Wanting this to be a valuable experience, I decided to study in Canada. This decision turned out to be one of the best of my life, as I gained extensive knowledge and valuable internship experience.<br>Currently, I am indulging in self-learning on topics like Cybersecurity and AI. I also enjoy collaborating and sharing my knowledge with others who are curious about these subjects."
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/kshitij-halankar/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/kshitij-halankar"
        },
        {
            "icon": "facebook",
            "title": "Facebook",
            "http": "https://www.facebook.com/kshitij.p.halankar"
        }
    ],
    "hobbies": [        
        {
            "icon": "guitar",
            "title": "Guitar"
        },
        {
            "icon": "utensils",
            "title": "Cooking"
        },
        {
            "icon": "mountain",
            "title": "Trekking"
        },
        {
            "icon": "fish",
            "title": "Fish"
        }
    ]
}