{
    "internationalizations": [
        {
            "language": "en",
            "description": "I was introduced to the world of computers when I was in second standard. I attained first rank in my class when I was in first standard and my dad gifted me a computer. I used to play games all day and slowly and steadily I got attached to the computer. I started getting curious about how computers worked. By the time I was in 10th standard, my curiosity had increased greatly and I had to choose a career path going forward. Since the choice was obvious, it was a no brainer for me and I decided to get a diploma in Computer Engineering.<br><br>During my Diploma, I touched various subjects (both hardware and software) and realized that there were multiple streams to choose a career from. I explored many areas and found my mind always leaning more towards the Software world. I decided on focusing on software while keeping a small touch on the hardware using my personal projects. <br><br>After completing my diploma, I decided to expand my software knowledge with a degree in Information Technology. By this time I had already started imagining myself as a developer who would contribute in solving software world problem. My enthusiasm led me to enter many coding competitions while exploring the coding world. One thing led to another and as time passed by I was in the final year of my bachelor's degree. I found myself again at making choices where I had to choose between higher studies and getting a job. Until this time my curiosity for learning always took over while making decisions. However this time I decided to give job a try and realized that getting experience was another form of learning (I was learning while making money).<br><br>After a few years I wanted to give learning one last visit and hence I decided to get a Masters in Applied Computing. Since it was going to be the last one, I wanted it to be worthwhile so I decided to get the masters in Canada. This was the largest jump of my entire life and one of the best decisions. I bagged lots of knowledge and got some good experience in my internship. Lately I indulge myself in self-learning some interesting topics like CyberSecurity, AI and I try to collaborate and share my knowledge with curious minds in the world."
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/kshitij-halankar/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/kshitij-halankar"
        },
        {
            "icon": "facebook",
            "title": "Facebook",
            "http": "https://www.facebook.com/kshitij.p.halankar"
        }
    ],
    "hobbies": [        
        {
            "icon": "guitar",
            "title": "Guitar"
        },
        {
            "icon": "utensils",
            "title": "Cooking"
        },
        {
            "icon": "mountain",
            "title": "Trekking"
        },
        {
            "icon": "fish",
            "title": "Fish"
        }
    ]
}