[
    {
        "id": 1,
        "position": 1,
        "startAt": "07-01-2017",
        "endAt": "06-30-2020",
        "companyName": "Vistaar Technologies",
        "website": "https://www.vistaar.com/",
        "logo": "assets/template/experience/logo/vistaar-logo.png",
        "internationalizations": [
            {
                "city": "Mumbai",
                "country": "India",
                "role": "Software Engineer",
                "description": "While working at <b>Vistaar Technologies</b> as a Software Engineer, I delivered several error free product releases by implementing enhancements, resolving defects, and deploying and testing combinations of builds on dev setups. My duties involved bug fixes and eradicating application security flaws where I prevented stale session and sensitive session cookie exposure by adding session replication in IDP authentication. As part of system improvement, I worked on improving application efficiency and robustness by modifying designs of API flows and refactoring code base. For catering customer requirements, I modeled 50+ customized product entities and workflows for solution features and APIs. Some of my activities included reducing build deployment and delivery time by building automation suites and scripts for daily deployment, sanity, dependency upgrades and security evaluation."
            }
        ],
        "technologies": [
            "Java", "JavaScript", "SQL", "Oracle", "Servlet", "RESTEasy", "OData", "Node JS", "NPM", "RxJS", "REST API", "Hibernate", "JDBC", "J2EE", "RMI"
        ],
        "medias": [
            {
                "icon": "linkedin",
                "title": "LinkedIn Vistaar Technologies",
                "http": "https://www.linkedin.com/company/vistaar-technologies"
            }
        ],
        "backgroundUrl": "assets/template/experience/mumbai.jpg"
    },
    {
        "id": 2,
        "position": 2,
        "startAt": "07-01-2020",
        "endAt": "09-30-2021",
        "companyName": "Vistaar Technologies",
        "website": "https://www.vistaar.com/",
        "logo": "assets/template/experience/logo/vistaar-logo.png",
        "internationalizations": [
            {
                "city": "Mumbai",
                "country": "India",
                "role": "Senior Software Engineer",
                "description": "After promoting to Senior Software Engineer in <b>Vistaar Technologies</b> I worked on some architecture designs such as Multiple Authentication allowing users to choose the authentication mechanism between several technologies such as LDAP and SAML. I worked on introducing enhancements in custom query language by adding 4 arithmetic expressions, 5 logical operators, and support for complex and nested queries by planning, designing, and constructing JSON query schema using Hibernate. My contribution to improving system performance included reducing overall API response time by 20% by debugging, diagnosing delays, and resolving defects in RESTful product APIs. As part of security enhancements, I enhanced security and robustness of web applications by conducting security vulnerability assessments, identifying and resolving potential security vulnerabilities. My duties mainly revolved around introducing and integrating new technologies in the application such as SAML 2.0, OAuth, OData, and Activiti by analyzing feasibility and evaluating product compatibility."
            }
        ],
        "technologies": [
            "Java", "Gradle", "ANT", "Nginx", "SAP", "Activiti", "JBPM", "SAML", "SSO", "LDAP", "OAuth", "ACF", "OWASP", "Azure ADFS", "RHEL", "SUSE", "Ubuntu", "CentOS"
        ],
        "medias": [
            {
                "icon": "linkedin",
                "title": "LinkedIn Vistaar Technologies",
                "http": "https://www.linkedin.com/company/vistaar-technologies"
            }
        ],
        "backgroundUrl": "assets/template/experience/mumbai.jpg"
    },
    {
        "id": 3,
        "position": 3,
        "startAt": "01-01-2023",
        "endAt": "12-30-2023",
        "companyName": "SOTI",
        "website": "https://soti.net/",
        "logo": "assets/template/experience/logo/soti-logo.png",
        "internationalizations": [
            {
                "city": "Mississauga",
                "country": "Canada",
                "role": "Full-stack Developer Intern",
                "description": "As a Full Stack Developer in <b>SOTI</b> I worked on several feature improvements and involved in integration between products and services to provide one-to-many relationships with the product and service instances. My duties involved bug fixing and feature enhancement where I developed customized components, templates, modules, services, and styles for Resource Permissions and Access Management using Angular and added unit tests for components. Furthermore, I performed Proof of concept on several new features including custom map system using ArcGIS to locate, track, draw geofence, and show location history of 10000+ live mobile devices. Some of my bug fixes involved increasing log accuracy by identifying and fixing log message bug affecting 300+ exception messages by introducing new log framework for business exceptions. I contributed in handling customer issue by conducting customer cases meeting and resolving critical customer issues."
            }
        ],
        "technologies": [
            "C#", "Angular", "TypeScript", "JavaScript", "SQL", "SCSS", "SQL Server", "Android", "IOS", "OAuth", "SAML", "LDAP", "Git", "JIRA", "Windows", "Jenkins", "karma", "Sonar Cube"
        ],
        "medias": [
            {
                "icon": "linkedin",
                "title": "LinkedIn SOTI",
                "http": "https://ca.linkedin.com/company/soti"
            }
        ],
        "backgroundUrl": "assets/template/experience/mississauga.png"
    }
]
