[
    {
        "thumbnail": "assets/projects/post-11-03-2019.jpg",
        "http": "https://github.com/kshitij-halankar/Zomaze",
        "date": "02-02-2022",
        "internationalizations": [
            {
                "title": "Zomaze",
                "description": "A zombie apocalypse basically begins in a world infested with zombies, while our main character, the protagonist, is being chased by these zombies and forced to enter a maze. The only way for him to escape safely is to complete this maze and all the other mazes that follow. Zomaze falls under the very popular Puzzle game genre with an added horror theme through the addition of zombies."
            }
        ]
    },
    {
        "thumbnail": "assets/projects/post-01-15-2019.jpg",
        "http": "https://github.com/kshitij-halankar/ACC-Web-Search-Engine",
        "date": "04-15-2022",
        "internationalizations": [
            {
                "title": "Web Search Engine",
                "description": "A Web Search Engine implemented using several advanced computing concepts and data structures such as page ranking using quick sort algorithm, in-memory caching with Least Recently Used Algorithm, efficeint index storage using TRIE, Link data storage using Modified Inverted Index, Spell Checking using Edit Distance Algorithm, Search filters using Regular Expression, Pattern Matching using Boyer-Moore algorithm."
            }
        ]
    },
    {
        "thumbnail": "assets/projects/post-07-10-2016.jpg",
        "http": "https://github.com/kshitij-halankar/MigratorExt",
        "date": "07-27-2022",
        "internationalizations": [
            {
                "title": "MigratorExt",
                "description": "A lightweight yet powerful database transformation and migration tool. It features relational to non-relational database migration along with support for converting various file formats such as CSV, XML, JSON into relational and non-relational database. Users have flexibility to generate mapping template to define database mappings."
            }
        ]
    },
    {
        "thumbnail": "assets/projects/post-05-07-2016.jpg",
        "http": "https://github.com/kshitij-halankar/TravelR",
        "date": "10-30-2022",
        "internationalizations": [
            {
                "title": "TravelR",
                "description": "An Android app which every traveller can rely on while travelling across the world and exploring different countries with their different standards. It provides many simple yet useful tools such as live currency rate conversion, global time, weight, volume, and many other unit conversions offline. Travellers can find local information about the places such as restaurants, places to visit, time and seasonal information and much more."
            }
        ]
    },
    {
        "thumbnail": "assets/projects/post-06-18-2016.jpg",
        "http": "https://github.com/kshitij-halankar/FTPsimulation",
        "date": "08-15-2022",
        "internationalizations": [
            {
                "title": "FTP Simulation",
                "description": "A Server-Client Program written in C language to simulate a real-time FTP protocol using several fundamental concepts such as sockets, processes, threads, memory management, file management, pointers, signals, fork, pipes, callback handler, dynamic memory allocation. The program is CLI and provides different commands to perform file operations."
            }
        ]
    },
    {
        "thumbnail": "assets/projects/post-06-04-2016.jpg",
        "http": "https://github.com/kshitij-halankar/SecureAutomatedOffice",
        "date": "03-04-2017",
        "internationalizations": [
            {
                "title": "Secure Automated Office",
                "description": "An IOT based Secure Automation system that organizations can integrate in their office without needing to worry about ubiquitous data collection and IOT component integrity. IOT device can communicate with each other in real time over an encrypted channel without losing the response speed. The algorithm features modified variant and combination of several top-grade algorithms."
            }
        ]
    }
]
